stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_fsk.c
    return err;
#else
    (void)rx_pkt_cfg;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_prepare_fsk_for_tx(sid_pal_radio_fsk_pkt_cfg_t * tx_pkt_cfg)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t err = RADIO_ERROR_INVALID_PARAMS;

    do
    {
        if (NULL == tx_pkt_cfg)
        {
            break;
        }

        if ((NULL == tx_pkt_cfg->phy_hdr) || (NULL == tx_pkt_cfg->packet_params) || (NULL == tx_pkt_cfg->sync_word) || (NULL == tx_pkt_cfg->payload))
        {
            break;
        }

        sid_pal_radio_fsk_packet_params_t *f_pp  =  tx_pkt_cfg->packet_params;
        if ((0u == f_pp->payload_length) || (0u == f_pp->preamble_length))
        {
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }

        sid_pal_radio_fsk_phy_hdr_t  *phr  = tx_pkt_cfg->phy_hdr;
        if ( ((RADIO_FSK_FCS_TYPE_0 == phr->fcs_type) && (f_pp->payload_length > MAX_PAYLOAD_LENGTH_WITH_FCS_TYPE_0))
          || ((RADIO_FSK_FCS_TYPE_1 == phr->fcs_type) && (f_pp->payload_length > MAX_PAYLOAD_LENGTH_WITH_FCS_TYPE_1)) )
        {
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }

        uint8_t   psdu_length      = f_pp->payload_length;
        uint8_t   *tx_buffer       = tx_pkt_cfg->payload;
        uint32_t  crc              = 0x00000000u;

        if (RADIO_FSK_FCS_TYPE_0 == phr->fcs_type)
        {
            crc = _compute_crc32(tx_pkt_cfg->payload, f_pp->payload_length);

            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 24);
            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 16);
            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 8);
            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 0);
        }
        else if (RADIO_FSK_FCS_TYPE_1 == phr->fcs_type)
        {
            crc = _compute_crc16(tx_pkt_cfg->payload, f_pp->payload_length);

            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 8);
            tx_buffer[STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length++] = (uint8_t)(crc >> 0);
        }
        else
        {
            err = RADIO_ERROR_NOT_SUPPORTED;
            break;
        }

        uint8_t  *sync_word               = tx_pkt_cfg->sync_word;
        uint8_t  sync_word_length_in_byte = 0u;
        memmove(tx_buffer + STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH, tx_buffer, f_pp->payload_length);
        /* Build the PHR and put it in the Tx buffer */
        tx_buffer[0] = (phr->fcs_type << 4);
        tx_buffer[0] += ((phr->is_data_whitening_enabled == true ) ? 1 : 0) << 3;
        tx_buffer[1] = psdu_length;

        if (phr->is_data_whitening_enabled != false)
        {
            _perform_data_whitening(WL55_FSK_WHITENING_SEED, tx_buffer + STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH,
                                    tx_buffer + STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH, psdu_length);
        }

        /* Build the syncword */
        sync_word[sync_word_length_in_byte++] = 0x55u;  /* Added to force the preamble polarity to a real "0x55" */
        sync_word[sync_word_length_in_byte++] = (phr->is_fec_enabled == true) ? 0x6Fu : 0x90u;
        sync_word[sync_word_length_in_byte++] = 0x4Eu;

        f_pp->sync_word_length     = sync_word_length_in_byte;
        f_pp->addr_comp            = (uint8_t)STM32WLxx_GFSK_ADDR_CMP_FILT_OFF;
        f_pp->header_type          = (uint8_t)STM32WLxx_GFSK_PKT_FIX_LEN;
        f_pp->payload_length       = STM32WLxx_RADIO_COMM_FSK_PHY_HEADER_LENGTH + psdu_length;
        f_pp->crc_type             = (uint8_t)STM32WLxx_GFSK_CRC_OFF;
        f_pp->radio_whitening_mode = (uint8_t)STMWLxx_GFSK_DC_FREE_OFF;

        err = RADIO_ERROR_NONE;
    } while(0);

    return err;
#else
    (void)tx_pkt_cfg;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_fsk_sync_word(const uint8_t * sync_word, uint8_t sync_word_length)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t                          err     = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t           hal_err;
    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)stm32wlxx_radio_get_drv_ctx_ctx();

    do
    {
        /* Check if we have any changes */
        if ((drv_ctx->applied_fsk_phy_cfg.sync_word_len == sync_word_length)
          && (SID_STM32_UTIL_fast_memcmp(drv_ctx->applied_fsk_phy_cfg.sync_word, sync_word, sync_word_length) == 0u))
        {
            STM32WLxx_FSK_LOG_DEBUG("Set FSK sync word - skipped, no changes");
            err = RADIO_ERROR_NONE;
            break;
        }

        hal_err = stm32wlxx_hal_radio_set_syncword(drv_ctx, STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK, sync_word, sync_word_length);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        drv_ctx->applied_fsk_phy_cfg.sync_word_len = sync_word_length;
        SID_STM32_UTIL_fast_memcpy(drv_ctx->applied_fsk_phy_cfg.sync_word, sync_word, sync_word_length);
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply FSK sync word. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)sync_word;
    (void)sync_word_length;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_fsk_whitening_seed(uint16_t seed)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    //FIXME: at least check it did not change. Or better send an update to WLxx
    return RADIO_ERROR_NONE;
#else
    (void)seed;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

