stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_fsk.c
    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply FSK packet params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)packet_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_fsk_time_on_air(const sid_pal_radio_fsk_modulation_params_t * mod_params, const sid_pal_radio_fsk_packet_params_t * packet_params,
                                                                 uint8_t packetLen)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    uint32_t time_on_air;

    if ((NULL == mod_params) || (NULL == packet_params))
    {
        time_on_air = 0u;
    }
    else
    {
        stm32wlxx_pkt_params_gfsk_t          fsk_pp;
        stm32wlxx_radio_fsk_phy_mod_params_t fsk_mp;

        fsk_pp.pld_len_in_bytes = packetLen;
        radio_pktparams_to_stm32wlxx_pktparams(&fsk_pp, packet_params);
        radio_modparams_to_stm32wlxx_modparams(&fsk_mp, mod_params);

        time_on_air = stm32wlxx_phy_get_gfsk_time_on_air_in_ms(&fsk_pp, &fsk_mp);
    }

    return time_on_air;
#else
    (void)mod_params;
    (void)packet_params;
    (void)packetLen;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_fsk_get_fsk_number_of_symbols(const sid_pal_radio_fsk_modulation_params_t * mod_params, uint32_t delay_micro_secs)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    uint32_t num_symb = STM32WLxx_SUBGHZ_US_TO_SYMBOLS(delay_micro_secs, mod_params->bit_rate);
    return num_symb;
#else
    (void)mod_params;
    (void)delay_micro_secs;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_fsk_tx_process_delay(void)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    const halo_drv_stm32wlxx_ctx_t * const drv_ctx = stm32wlxx_radio_get_drv_ctx_ctx();
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    const uint32_t fsk_tx_process_delay =
        (STM32WLxx_RADIO_CFG_USE_DEFAULT_TIMINGS == drv_ctx->config->processing_timings.fsk.tx_process_delay_us) ?
        STM32WLxx_FSK_TX_DEFAULT_PROCESS_DELAY_US : drv_ctx->config->processing_timings.fsk.tx_process_delay_us;

    const uint32_t process_delay = fsk_tx_process_delay + drv_ctx->config->state_timings.tcxo_delay_us - STM32WLxx_SIDEWALK_FSK_CS_DURATION_US;
    return process_delay;
#else
    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_fsk_rx_process_delay(void)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    const halo_drv_stm32wlxx_ctx_t * const drv_ctx = stm32wlxx_radio_get_drv_ctx_ctx();
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    const uint32_t fsk_rx_process_delay =
        (STM32WLxx_RADIO_CFG_USE_DEFAULT_TIMINGS == drv_ctx->config->processing_timings.fsk.rx_process_delay_us) ?
        STM32WLxx_FSK_RX_DEFAULT_PROCESS_DELAY_US : drv_ctx->config->processing_timings.fsk.rx_process_delay_us;

    const uint32_t process_delay = fsk_rx_process_delay + drv_ctx->config->state_timings.tcxo_delay_us + STM32WLxx_FSK_RX_PROCESS_SAFETY_GAP_US;
    return process_delay;
#else
    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}
